《框架思维》读后感(一)：思维框架，决定了人生的高度

　　框架底层要素1：因果律

　　人类具有抽象思维能力，能够把因果推论转化为框架。这些心智模型就成为可供反复利用的模板，可以不断应用到新的环境中。它未必完美，但灵活，可以相互替代，不仅减轻了我们的认知负担，而且大大减少了决策时间。

　　如何更好地以因果模板进行思考？首先，至少要有因果模板意识;其次，在思考问题时要懂得如何去利用它。你可以停下来问问自己:“发生这件事的原因是什么？我是怎么解释的？这么解释是否正确呢？”

　　框架底层要素2:反事实思维

　　反事实思维是建构框架的第二个要素，它以目标为导向，透过现状做出各种预想，以提前应对可能出现的情况及问题。你会发现，反事实不是空想幻想，而是以目标为导向的，取决于我们对因果关系的理解。

　　反事实思维和因果推理二者是相辅相成的：如果没有因果关系，我们将被淹没在一片无意义的事件海洋中，漫无头绪；如果缺少了反事实思维，我们将被现实所困，毫无选择余地。

　　反事实思维的闪光处在于:

　　1. 可当作是对“因果决定论”的一种制衡。因果决定论认为道路只有一条，但是，当你想象另一种可能性时，也会想到不同的原因。

　　2. 我们和反事实互动的方式使之变得可为我所用。想象某些不存在的东西，比用纯粹的概念术语思考更容易。

　　3. 可以激活我们的隐性知识，发现更多创造性解决方案。

　　4. 给人一种使命感，使我们从理解转向行动，从领悟转向决策。

　　框架底层要素3：约束

　　应对约束，关键在于收放自如，约束过多，你可能会错过要事;约束过少，你可能无法聚焦要点。应该怎么做？

　　你首先需要认识到，每一个框架都有软约束与硬约束，软性约束是有弹性的或可改变的，只需付出相当的努力即可进行调整。硬性约束是固定的、不可渗透的和不可侵犯的。硬性约束是心智模型的核心所在，忽略它就意味着放弃框架本身。

　　所以，当你为了进行反事实思维而选择约束条件时，先要确保守住那些硬性约束，而在选择软性约束时，舍恩伯格总结了三条指导原则:

　　当我们具备了框架思维时，我们就具备了解决问题的能力，找到目标，分析过程，通过框架思维的三大底层要素，学会换位思考和逆向思考，让自己成长越来越快，最终走向成功。

　　《框架思维》读后感(二)：3种思维助你更完整地看世界，更好地解决问题

　　人无时无刻不在做决定，小到吃穿用度大到找工作，创业，找伴侣，买房等等，这些时候你是如何思考的，比如你要购买口罩，如何选择合适的口罩，是不是要想口罩的标准是什么，不同标准的防护级别是怎么样的？自己需要在什么场景使用适合自己的口罩？款式和型号是什么？在哪个平台购买？购买什么样的品牌的？

　　再比如你要买房是不是要想周边的产业有多少上市，公司高薪人群比例如何？这个房子的地理位置对孩子的教育是否有利，对应的学区是什么？这个小区的房子是全新的还是老破小房子的户型？如何购买用途是自住还是投资？

　　你可能隐约感觉到自己在做决定时不仅仅基于理性推论，还要基于一些更基础的东西，这些东西让你对事物运转有一种直觉，能够更清晰的意识到自己是如何思考，如何坚持或改变自己想法的。

　　这些底层的东西有一个流行的说法就是框架。顾名思义，框架就是架子上有建筑学上的框架，帮助你提高盖房子的效率。由软件工程上的框架帮助你提高开发软件的效率。同时还有一种认知框架。认知框架就是那些协助我们作出选择作出判断的底层架子。 高手做事，都有自己的框架。有了自己的框架，就能在未知的问题上正确定义，设计策略，锁定问题的本质，高效做出决定。《框架思维》将教你如何构建框架。

　　本书是由三位行业翘楚联合打造，其中一位是大名鼎鼎的大数据之父【奥】维克托.迈尔—舍恩伯格与【法】杂志高级编辑 肯尼斯.库克耶，【法】管理学教授，弗朗西斯.德维西库专注于决策、模型和数据的研究领域。

　　01 因果律思维

　　框架的底层要素之一是因果关系，世界为什么可以预测，因为你是用因果关系来看待世界的，简单说就是从原因推论出结果，我们能够在行动之前预测出每个决定可能带来的后果，从而不断修正，优化自己的行动方案。

　　人类一生下来就懂得某些对世界因果关系的认知，即使是婴儿也知道掉落的物体会垂直落下，人类也会很自然的从经验中总结出因果关系。

　　所以如何更好的以因果模板进行思考，首先要有因果模板的意识，其次在思考问题时要懂得如何去利用它，你可以停下来问问自己发生这件事的原因是什么？我是怎么解释的，这么解释是否正确呢？

　　02 反事实思维

　　框架底层要素第二点就是。反事实思维。意思是说人类大脑具有模拟能力，在行动前会先模拟环境，想想可能出现的情况，进而判断是否需要采取行动，或者如何行动，从而规避了伤害自身的行为。

　　反事实思维以目标为导向，和因果关系是相辅相成的。能让我们更好地成为因果思考者，当你看见更多可能性时，视野也会被拓宽，而不会被困于泥沼，我们和反事实互动的方式使之变得可为我所用，想象某些不存在的东西比用纯粹的概念术语思考更容易，同时反事实思维还给人一种使命感，能够帮助我们从理解转向行动，从领域转向决策。

　　03 约束思维

　　约束是建构框架发挥作用的第3个要素，为什么要约束呢？因为人类的想象力是无穷尽的，你可以想象出无数与英国心智模型无关的现实，但是她们对你的行动是否都有参考价值，适当的约束才能让我们合理发挥想象力，有效释放创造力，为决策和行动提供正确的指导。

　　从某种意义上来说，约束实际上是释放了自由而非捆绑的手脚。首先你需要认识的每一个框架都有软约束与硬约束软约束是有可弹性的改变的成分，只需要付出相当的努力就可以进行调整，硬性约束是固定的，不可收到的和不可侵犯的硬性约束是心智模型的核心所在，忽略它就意味着放弃框架本身。

　　所以当你为了进行反事实思维，而选择约束条件是要先确保守住那些硬性约束，而在选择软性约束时，可以有可变性，最小变化和一致性。

　　有了约束你就可以确定决策展开，行动框架的建构，就从认知范畴转向至关重要的行动，所以到目前为止认识了这三个底层思维，你发现框架如何发挥作用了吗？

　　框架赋予我们认知能力。（由于因果律）和行动能力（通过反事实思维），也确保我们的认识和行动有意义。（通过恰当的约束。）

　　如果当前的框架无法满足需求怎么办？那就要重新建构，框架越多元的框架越能让你发现不同的观点，主动去拥抱变量，更加适应环境的变化。

　　所以当你具备了以上三种思维，你就可以更好地看待这个世界，并且用更好的行动去解决问题。

　　《框架思维》读后感(三)：高手做事的方法你应该知道三个要素

　　人无时无刻不在做决定，小到吃穿用度，大到找工作、创业、找伴侣、购房等，这些时候如何思考的？

　　你可能隐约感觉到，自己在做决定时，不仅仅基于理性推论，还要基于一些更基础的东西，这些东西，让你对事物运转有一种直觉，能够更清晰意识到自己是如何思考、如何坚持或改变自己想法。

　　这些底层的东西，在科学界有不同说法。而最流行的一个说法就是：框架。

　　顾名思义，框架就是架子，有建筑学上的框架，帮助我们提高盖房子的效率，帮助我们提高开发软件的效率，

　　在思考时，也存在认知框架。什么是认知框架？认识框架就是哪些协助我们做出选择、做出判断的底层架子。

　　埃隆·马斯克、查理·芒格推崇的《框架思维》的思维模式；深度思考、看清底层逻辑的思维工具；提升能力，实现“人生开挂”：想要做事有逻辑，说话有条理，决策思考有根基，就要所想所做都有框架。

　　即使遇到新事物或者新情况，我们也可以迅速找到合适的架子套上，做到凡事有章有法。

　　可以说，我们的框架决定了我们的认知水平，从而决定了我们人生的高度。

　　我们常常将人类高阶认知能力总结为4中底层认知能力：命名、分类、变形与旋转。在《框架思维》的本书中，作者们将其中结合为三大要素：

　　框架底层要素1：因果律

　　因果关系是建构框架的一个基本要素。因为我们是用因果关系来看待世界的。简而言之，就是从原因推论出结果。因而我们能够在行动之前，预测出每个决定可能带来的后果，从而不断修正优化自己的行动方案。

　　因为人类具有抽象思维能力，能够把因果推论转化为框架。这些心智模型就成为可供反复利用的模板，可以不断应用到新的环境中。它未必完美，但灵活，可以相互替代，不仅减轻了我们的认知负担，而且大大减少了决策时间。

　　如何更好地以因果模板进行思考？首先，至少要有因果模板意识; 其次，在思考问题时要懂得如何去利用它。你可以停下来问问自己: “发生这件事的原因是什么？我是怎么解释的？这么解释是否正确呢？”

　　框架底层要素2:反事实思维

　　英国哲学家卡尔·波普尔有句名言:“让假设代替我们去死。”意思是说，人类大脑具有模拟能力，在行动前，会先模拟环境，想想可能出现的情况，进而判断是否需要采取行动或如何行动，从而规避了伤害自身的行为。

　　它以目标为导向，透过现状做出各种预想，以提前应对可能出现的情况及问题。

　　想象另一种现实，我们的因果推理就具有了可操作性。

　　反事实思维的闪光处在于:

　　1. 是对“因果决定论”的一种制衡。

　　2. 能让我们成为更好的因果思考者，看见更多可能性时。

　　3. 我们和反事实互动的方式使之变得可为我所用。

　　4. 是可以激活我们的隐性知识，发现更多创造性解决方案。

　　5. 是能给人一种使命感，使我们从理解转向行动，从领悟转向决策。

　　框架底层要素3:约束

　　约束是建构框架发挥作用的第三个要素。人类的想象力是无穷尽的，但是，它们对你的行动是否都有参考价值？适当的约束才能让我们合理发挥想象力，有效释放创造力，为决策及行动提供正确指导。

　　首先需要认识到，每一个框架都有软约束与硬约束，软性约束是有弹性的或可改变的，只需付出相当的努力即可进行调整。

　　所以，当进行反事实思维而选择约束条件时，先要确保守住那些硬性约束，而在选择软性约束时，舍恩伯格总结了三条指导原则:

　　▪ 可变性:指选择可以改变的约束;

　　▪ 最小变化:指对约束应仅做微调，而非彻底改变;

　　▪ 一致性:指某个约束的改变不能与另一个约束产生矛盾和冲突。有了约束，你就可以确定决策，展开行动，框架的建构就从认知范畴转向至关重要的行动。

　　框架赋予我们认识能力(由于因果律)和行动能力(通过反事实思维)，它也确保我们的认识和行动有意义(通过恰当的约束)。

　　有框架思维和没有框架思维的人一时半会看起来差别不大，但是日积月累人生的差距会越拉越大。

　　当我们具备了框架思维时，我们就具备了解决问题的能力，找到目标，分析过程，通过框架思维的三大底层要素，学会换位思考和逆向思考，让自己成长越来越快，最终走向成功。

　　《框架思维》读后感(四)：学习高手的框架思维 从容应对纷繁复杂的社会

　　框架思维就是协助我们做出选择、做出判断的底层架子，我们也可称为认知框架。《框架思维》是由三位大师级专家合著的，维克托·迈尔-舍恩伯格：被誉为“大数据之父”，是《科学》《自然》等著名学术期刊推崇的互联网研究者之一，现任牛津大学互联网研究所治理与监管专业教授。弗朗西斯·德维西库：柏林欧洲管理与技术学院(ESMT)管理学教授和决策、模型和数据中心主任。肯尼斯·库克耶 ：《经济学人》杂志高级编辑。

　　本书是一本教我们如何搭建认知框架的书，书中说，高手做事，都有自己的框架，而框架可以帮助我们正确地定义问题，设计策略，从而直击事物的本质。

　　什么是框架思维？

　　什么是框架思维？给你讲个我的小故事。有一天，当我看完麦肯锡的经典《金字塔原理》，兴奋不已，因为那是我第一次明白框架思维的强大。结果第二天上外教课时，老师让我们七个人组成一组，就“如果你发现你的同事最近突然对你有敌意，请你用积极思维去解决这件事”拿出我们的方案。如果你拿到这个题，你会怎么做？对于这样的话题，实在太开放了，每个人都有无数的想法，这些想法非常杂乱无章，如果任凭你一句我一句的，恐怕很难在短时间拿出一个很棒的答案出来。

　　那一刻，我的大脑里突然就冒出了框架思维这个东西，我建议大家“我们先建立一个框架吧，这样讨论起来更有条理”。于是我们先建立了一个简单的框架“为什么+怎么做”，即为什么同事会突然跟我们过不去？我们应该怎么做？

　　在每一个大框架下，我们又建立了子框架“他自己、我自己、第三方”，即他这么做的原因可能是因为他本人的原因，比如遇到一些烦心事；也可能是我们的原因，我们做了一些事，无意伤害了他；或者来自第三方产生的误解。

　　如何构建框架？

　　人人都可以构建框架，我们只要掌握了方法，然后通过训练和不断的积累经验就可以建立新的框架，同时我们还需要对新事物持开放态度。也就是说，我们需要以积极的心态去接受新的事物。在构建框架时，我们还需要避免框架的僵化，增强思维敏捷性，也就是保持框架的灵活性。书中列举5种建构和运用框架指南：

　　1、发挥心智模型的作用，框架建构时刻都在发生，但它可被专门用于改进决策。

　　2、有节制地梦想，运用一个框架意味着迅速高效地识别出适合的选项。

　　3、聪明地重构框架，转向另一个框架可令你以不同的眼光看待世界。

　　4、条件很重要，我们可以通过认知多样性提高建构框架的能力。

　　5、超越自我去思考，社会的作用是确保框架多元化，以便在变化之际获得最优的应对之策。

　　框架思维在学习、工作和生活的运用

　　我们无时无刻不在做决定，不管是学习、工作还是生活，都需要我们去思考，怎么做对我们来说才是最好的选择呢？

　　学习中体现在三个方面：

　　1、培养归纳总结的能力，提升学习的效率；

　　2、建立自己的知识体系，学会举一反三；

　　3、打开思路以多元的方式看问题。

　　工作中运用体现在三个方面：

　　1、说话做事有逻辑、有条理；

　　2、快速高效地完成交待的任务；

　　3、以正确的方法解决新情况、新问题。

　　生活上体现在如下三个方面：

　　1、做对人生关键决策；

　　2、独立思考，避免被割韭菜；

　　3、获得财富和幸福。

　　作者说，没有框架，再多的努力也只是低水平的重复。有框架思维和没有框架思维的人一时半会差别不大，但日积月累，人生的差距会越拉越大。框架思维应该也是学习力的一部分，学好此思维，学习能力应该也会进一大步。

　　《框架思维》读后感(五)：所谓上善若水，就是思维有多广你的边界就有多大？

　　最近几年时常会听到有人说，不要给自己设限。这句话说的是什么？

　　前段时间在读《庄子·人间世》中，发现这样一个故事。说鲁国有一位叫闫阖的大夫，他被派到魏国去担任太子的专职老师，但是他发现这位太子很是顽劣。

　　于是他就去请教高人籧伯玉。他问籧伯玉：有这样一个人，他天性残暴。如果放弃原则去迁就他，怕国家因此受害，但如果坚持原则去辅导他又怕自己受害。这个人老觉得都是别人的错，自己从来没错，怎么办？

　　籧伯玉这样建议他：首先要端正自己的言行，做到内在谦和，外在迁就。但是迁就不能太过分，不然自己也会跟着丧失立场，内在的谦和也不太过了，否则就会变成“博取名声的正人君子”，最后招致祸害。

　　最后，总结道一句：行就二心和，顺而化之。意思就是说这个人如果是婴儿性格，就跟他完婴儿的游戏，如果他不摆官架子，也就不用敬畏他，把他当兄弟，如果他是放荡不羁的样子，也去跟他放荡不羁。

　　通俗地讲就是：见人说人话，见鬼说话。需要活泛地去对待不同的人。用古人的话来说，要有处世之“道”，这个道也可以叫“心法”。在古代“心法”厉害了，可以说什么“剑法”都可以学会。我觉得这个心法，就像是现代所说的“思维边界”，或者“思维框架”。

　　所以说道越高，思维边界越广，那么高手做事一定是有自己的思维框架。没有框架再多的努力也只是低水平的重复。

　　在《框架思维》这本书中，就为我们提供了如何利用框架思维讲问题想清楚，说明白，做正确的心法。这个思维模式直击事物的本质，这就是思维框架的能力。通过框架，我们得以获得对于事物的准确认知，从而作出优质的判断和决策。

　　这本书告诉我们高手做事，都有独属自己的框架，这个框架帮助我们正确地定义问题，设计策略，从而能够让我们直击事物的本质。即便是在面对不熟悉的新情况，我们也能够利用框架从旧有的知识中整合出新方法，以更高明的方式解决问题。框架思维让我们能够应对不断变化的复杂世界。

　　我们的行动路线取决于我们之所见。2017年获得了麦克阿瑟“天才奖”的巴尔齐莱，她源自一部科幻电影《2001太空漫游》中的超级计算机哈尔的灵感，将一个脱颖而出的分子命名为“海利霉素”，这种分子可以杀死超级细菌。

　　发现海利霉素的过程不仅是一项重大科学突破，也不仅仅意味着我们朝着加快药物开发速度，降低成本的方向迈出了重要的一步。这正是他们通过挖掘人人都有的独特的认知力获得了创新灵感。

　　我们在日常生活中也是有意无意依赖我们所看到的事物整合信息。比如换工作，生孩子，等，我们就会我们会清晰地意识到自己如何审时度势，如何刻意坚持亦或是改变自己的看法。

　　因为我们的思考依赖框架。这样复杂的世界就变得豁然开朗。想要在这个世界立足，我们需要对周围的一切进行解释，这就是上述例子中的巴尔齐莱的成就虽然令人印象深刻，可人们其实并没有真正明白她成功的原因所在。她就是一位架构者，通过正确的方式架构事物，最后得以解锁解决方案。

　　所以建构框架对于我们来说至关重要。我们采用什么样的框架，会影响到我们所做的选择，影响到我们的决定以及最终取得的结果。而如果我们能更长于建构架构，我们就可以获得更好的自己想要的结果。

　　在明斯基，和诺贝尔奖获得者卡尼曼等前辈开创的框架研究基础之上，这本书再一次强调了作为人类基础认知能力的重要性，学会在大数据时代更好地优化自己的认知框架。书中为我们总结了三大要素：因果律，反事实思维和约束。

　　这三者有着相辅相成的联系。我这里大概说一下，感兴趣的小伙伴可以去书中寻找具体的做法，看看他们如何微妙联结。总之框架赋予我们基于因果律的认识能力，通过反事实思维的行动能力还有通过恰当的约束确保我们的认识和行动更有意义。

　　而如何去构建框架，只是需要一定的技巧，这些技巧可以通过训练和经验获得。具体包括连个不同的过程，那就是应用框架与框架转换。当应用框架时，需要考虑到刚刚所说的三大要素，它可以帮助我们迅速确定合适的选项并行动。

　　在《幸福的三个真相》中说到：你今天建立的自我保护之墙，明天将会成为自我囚禁之墙。用这本书中的观点就是框架转换。当框架转换时，我们需要注意它的风险，因为框架转寒能让我们从不同的角度看待问题，从而可能让我们获得更大的回报。

　　老子在《道德经》里说：上善若水。我们知道水是没有一个固定的样式，在什么容器就会呈现不同的样式。我们也要练就自己的思维框架，遇到不同的问题，精准采用合适思维框架。当我们以正确的方式应用正确的框架，改善与调整框架，也许会带来更好的人生发展结果。

　　《框架思维》读后感(六)：框架思维让我们聚焦事物的本质

　　两年前新冠肺炎席卷全球，国人佩戴口罩已成为习惯。但在美国有一部分人根本不戴口罩，平日里随意地出入公共场合。这种在我们看来不怕死的匪夷行为背后，是缘于他们以自由为框架去思考问题的，而不是以人的健康为框架。

　　说起框架，很多人头脑里浮现出建筑上的框架能帮助工人提高盖房子的效率。人的认知框架，就是帮助人类做出决定的有效工具。

　　高手做事，都有自己的框架。有了自己的框架，就能在未知的问题上正确定义，设计策略，锁定问题的本质，高效做出决定。《框架思维》将教给你如何构建框架，让你在变幻莫测的时代，立于不败之地。

　　本书是由三位行业翘楚联合打造，其中一位是大名鼎鼎的大数据之父【奥】维克托.迈尔—舍恩伯格与【法】杂志高级编辑 肯尼斯.库克耶，【法】管理学教授，弗朗西斯.德维西库专注于决策、模型和数据的研究领域。

　　说起框架，很多人头脑里浮现出建筑上的框架能帮助工人提高盖房子的效率。人的认知框架，就是帮助人类做出决定的有效工具。

　　高手做事，都有自己的框架。有了自己的框架，就能在未知的问题上正确定义，设计策略，锁定问题的本质，高效做出决定。《框架思维》将教给你如何构建框架，让你在变幻莫测的时代，立于不败之地。

　　本书是由三位行业翘楚，其中一位是大名鼎鼎的大数据之父【奥】维克托.迈尔—舍恩伯格与【法】杂志高级编辑肯尼斯.库克耶，还有【法】管理学教授，弗朗西斯.德维西库专注于决策、模型和数据的研究领域，三位背景横跨经济、技术和管理决策等领域，能帮助我们更好地应对时代的挑战，从中受益。

　　那些高手在遇到问题是如何思考？他们的做事方法不过是拥有把问题想清楚、说明白、做正确。简言之，就是用框架思维去思考问题。

　　框架底层要素有三个，高手首先利用因果关系看待问题，从原因推出结果，在做出决定之前，能模拟现实，预测出各种后果，然后从中筛选出最正确的解决方案。

　　其次是用反事实思维要素去思考问题，遇到问题人们通常用经验去解决问题。如果经验解决不了后，高手就会以目标为导向，发挥自己的想象力，有多种方法去解决问题。

　　最后就是运用约束力，从想象的多种方法中找出那些合理有效的方法。人的想象可以天马行空，必须加以约束，找到有价值的解决方案。

　　就像生活中两人象棋对弈，首先你心中要有全盘考虑的意识，对方每走一步棋，都将对全局形势或平衡有一个变化，你必须用框架思维去应对，在多种框架中挑选出最有利于自己，最正确的框架做决定。

　　如果没有挑选正确的框架，就会落得一步走错，满盘皆输的后果。我们的人生又何尝不是如此呢。

　　框架的重要性可见一斑，那么我们如何去构建框架呢？

　　必须有开放达观的胸怀，学会归纳总结规律和模拟事物发展的方向，不再局限因果律的单一的方法，拥有更多的解决问题的方法，让自己不断地成长。

　　框架的构建，增强我们解决问题的能力。有些未知的问题，利用现有的框架依然得不到解决，那我们就需要框架重构。

　　框架的意义在于它实现了什么。框架让我们用更开放灵活的思维，从不同的角度看世界，丰富自己的认知，找到更好的解决方案。

　　框架是帮我们找到解决方案的一个手段，一个重要的工具，需要时间和决心。构建框架是一个过程，是引导认识、想象和评估各种选择的一种方法。 框架思维，让我们对世界的看法是完整的，而不是片面的。优化和积累知识框架，才能对未知复杂的问题，做出解答。

　　学会框架思维，就能让我们的大脑以一种有序、有目的和受约束的方式进行思考，面对纷繁复杂的世界，更好地聚焦事物的本质，忽略那些不重要的，更高效快速地解决问题。

　　框架思维让我们学会适当地控制想象空间，多想出几个有价值的替代解决方案。普通人通过有意识地训练，培养新视角的好奇心，有一颗强大的内心，获得思维的敏捷性，扩展认知范围，也会成为生活和工作中的高手。

　　《框架思维》读后感(七)：框架思维让我们聚焦事物的本质

　　两年前新冠肺炎席卷全球，国人佩戴口罩已成为习惯。但在美国有一部分人根本不戴口罩，平日里随意地出入公共场合。这种在我们看来不怕死的匪夷行为背后，是缘于他们以自由为框架去思考问题的，而不是以人的健康为框架。

　　说起框架，很多人头脑里浮现出建筑上的框架能帮助工人提高盖房子的效率。人的认知框架，就是帮助人类做出决定的有效工具。

　　高手做事，都有自己的框架。有了自己的框架，就能在未知的问题上正确定义，设计策略，锁定问题的本质，高效做出决定。《框架思维》将教给你如何构建框架，让你在变幻莫测的时代，立于不败之地。

　　本书是由三位行业翘楚联合打造，其中一位是大名鼎鼎的大数据之父【奥】维克托.迈尔—舍恩伯格与【法】杂志高级编辑 肯尼斯.库克耶，【法】管理学教授，弗朗西斯.德维西库专注于决策、模型和数据的研究领域。

　　说起框架，很多人头脑里浮现出建筑上的框架能帮助工人提高盖房子的效率。人的认知框架，就是帮助人类做出决定的有效工具。

　　高手做事，都有自己的框架。有了自己的框架，就能在未知的问题上正确定义，设计策略，锁定问题的本质，高效做出决定。《框架思维》将教给你如何构建框架，让你在变幻莫测的时代，立于不败之地。

　　本书是由三位行业翘楚，其中一位是大名鼎鼎的大数据之父【奥】维克托.迈尔—舍恩伯格与【法】杂志高级编辑肯尼斯.库克耶，还有【法】管理学教授，弗朗西斯.德维西库专注于决策、模型和数据的研究领域，三位背景横跨经济、技术和管理决策等领域，能帮助我们更好地应对时代的挑战，从中受益。

　　那些高手在遇到问题是如何思考？他们的做事方法不过是拥有把问题想清楚、说明白、做正确。简言之，就是用框架思维去思考问题。

　　框架底层要素有三个，高手首先利用因果关系看待问题，从原因推出结果，在做出决定之前，能模拟现实，预测出各种后果，然后从中筛选出最正确的解决方案。

　　其次是用反事实思维要素去思考问题，遇到问题人们通常用经验去解决问题。如果经验解决不了后，高手就会以目标为导向，发挥自己的想象力，有多种方法去解决问题。

　　最后就是运用约束力，从想象的多种方法中找出那些合理有效的方法。人的想象可以天马行空，必须加以约束，找到有价值的解决方案。

　　就像生活中两人象棋对弈，首先你心中要有全盘考虑的意识，对方每走一步棋，都将对全局形势或平衡有一个变化，你必须用框架思维去应对，在多种框架中挑选出最有利于自己，最正确的框架做决定。

　　如果没有挑选正确的框架，就会落得一步走错，满盘皆输的后果。我们的人生又何尝不是如此呢。

　　框架的重要性可见一斑，那么我们如何去构建框架呢？

　　必须有开放达观的胸怀，学会归纳总结规律和模拟事物发展的方向，不再局限因果律的单一的方法，拥有更多的解决问题的方法，让自己不断地成长。

　　框架的构建，增强我们解决问题的能力。有些未知的问题，利用现有的框架依然得不到解决，那我们就需要框架重构。

　　框架的意义在于它实现了什么。框架让我们用更开放灵活的思维，从不同的角度看世界，丰富自己的认知，找到更好的解决方案。

　　框架是帮我们找到解决方案的一个手段，一个重要的工具，需要时间和决心。构建框架是一个过程，是引导认识、想象和评估各种选择的一种方法。 框架思维，让我们对世界的看法是完整的，而不是片面的。优化和积累知识框架，才能对未知复杂的问题，做出解答。

　　学会框架思维，就能让我们的大脑以一种有序、有目的和受约束的方式进行思考，面对纷繁复杂的世界，更好地聚焦事物的本质，忽略那些不重要的，更高效快速地解决问题。

　　框架思维让我们学会适当地控制想象空间，多想出几个有价值的替代解决方案。普通人通过有意识地训练，培养新视角的好奇心，有一颗强大的内心，获得思维的敏捷性，扩展认知范围，也会成为生活和工作中的高手。

　　《框架思维》读后感(八)：想清楚说明白做正确的思维方式

　　在发表个人意见时，不知所言、言之无物

　　在工作遇见问题时，毫无头绪、不知如何着手解决

　　在读一本书时，不知道读什么内容，读后头脑空空无收获

　　在写文案时，拿着主题，咬笔头不知道写什么

　　……

　　这些问题，你遇见过吗？其实这就是在于我们思维方式的底层的东西，可以说是底层逻辑，可以说是帮助我们正确地定义问题、设计策略，从而直击事物的本质，做出正确的解决方案。而这样的方法论，就叫做“框架思维”，所谓框架就象是建筑学上的梁柱，也象软件工程上的架构…… 就是有清晰的层级条理，比如我们在思考时的认知框架就是可以协助我们做出选择、做出判断的底层架子，有框架思维的人就做得有条有理，没有框架思维的人呢就如同文章开头的情形，有句话说“有些人读了很多书，却依然过不好这一生”，为什么呢？不止是想到和做到的距离，最底层的原因就是他们的思维方式没有改变，没有构建正确的框架思维。

　　《框架思维》就是一本系统讲解框架思维的书：想清楚、说明白、做正确。有了框架思维，在我们面对不熟悉的场景时，能够从旧有的知识中整合出新的方法，以更高效的方式解决问题；在面对熟悉的场景时，框架可以帮助我们迅速做出反应，并聚焦重点，从而减少认知负担。

　　维克托·迈尔-舍恩伯格，被誉为“大数据之父”“大数据时代的预言家”，是《科学》《自然》等著名学术期刊推崇的互联网研究者之一。现任牛津大学互联网研究所治理与监管专业教授；肯尼斯·库克耶，《经济学人》杂志高级编辑；弗朗西斯·德维西库，柏林欧洲管理与技术学院管理学教授和决策、模型与数据中心主任。本书的三位作者都是各自行业的佼佼者，他们的行业背景横跨经济、技术与管理领域，就决定了我们可以学习不断变化的认知框架，更好的应对时代的挑战。

　　一、《框架思维》的三大底层要素

　　1、框架底层要素一：因果律

　　框架思维是心智模型，它的表现就是人们认识的常理；是在人们的潜意识里不被觉察下运作，基于直觉的判断。而框架思维就是面对事情时，会自动的检索问题，生成决策和行动方案；这是有框架思维的人，而没有框架思维的人呢，则是面对事情做不出反应，茫然一片。这就是人们在思考做事的思维方式和认知系统，有或者没有框架思维的结果就是要么让云山雾罩变得简洁明了，要么让简单的事情绕成一团乱麻。

　　因果关系是建构框架最基本的要素，因果关系，是我们看待世界最直接的方式：从原因推论出结果。因果律就是遵循常识，比如：日升日落；种豆得豆、种瓜得瓜；掉落的物体会垂直落下等。因果关系有助于我们了解现实世界，并预测我们所做决定带来的后果。

　　我们把因果关系的经验总结抽象成框架，这样的心智模型就成为可以反复利用的模板，让我们在遇问题时直接就调用了因果模板：发生这件事的原因是什么？我是如何解释的？这样的解释是否正确呢？当我们探询答案的时候，就会生成初步的策略。

　　2、框架底层要素二：反事实思维

　　我们的大脑有假设模拟的能力，一方面会根据现有条件推动这个事情的自然路径的解决方案；同时，在反事实思维的模板下，以目标为导向，透过现状做出更多的假设、设计更多的可能性，就是多问为什么？还有什么可能？等等，甚至是质疑的存在，以提前应对可能出现的情况及问题。

　　这是对因果决定论的一种制衡，因为如果我们只相信因果，那就是认定只有一个结果，但是，当我们设想会有另一种可能的时候，就会倒推出更多可能存在的不同原因。这样让我们的视野更加宽阔，看见更多的可能性，不会“一叶障目，不见森林”。

　　3、框架底层要素三：约束

　　因为人类的想象力是无穷尽的，完全可以想象出与常理、因果关系无关的的现实，但是它们对行动是否有价值，是否合乎常理都有待商榷，没有边界，也会耗费能量。

　　所以就有了约束，它以特定的方式塑造我们反事实思维的规和限制，在合理的范围内发挥想象力，有效释放创造力，为决策及行动提供正确的指导。

　　二、每个人都可以建构框架

　　人人都可以建构框架，关键点是我们需要训练和经验，更重要的是对新事物保持开放的态度。

　　有一个案例是，中国的喜茶创始人聂云宸通过对茶叶行业的分析，通过对产品和营销模式的改变，最终成功的打造了中国茶饮新品牌，2020年在中国创立了400多家门店，个人身价超过5亿美金。他并没有发明什么新的东西，但是创新思维令他获得了成功。就是在原有的框架思维上，做了重新的构建，创造了新的可能。

　　三、建立框架思维需要搭建建知识体系

　　这本书很容易读懂，因为书中的理念和理论知识都容易理解，并不十分深奥，而恰是如此，有人会觉得不知所云；因为人们往往会更乐意于去研究那些深奥枯燥的理论，而忽略对于常识的理解和利用。再有就是从“想到”到能够“做到”是有巨大的鸿沟，那就是要有大量的行动才可以。

　　同时这本书也是近几十年来在复杂性科学与人工智能领域最新研究成果融合之后的实践产物，也是三位作者横跨行业、学术研究等，所涉及到的理论、用典等涉猎广泛；所以要更好的理解这本书，在理解本书的要旨后，根据《框架思维》的方法论，要建构和应用构架，打造属于我们自己的特殊能力，那一定是要进行大量阅读更多领域的书藉的，包括人文、历史等方方面面，这样才能建立起属于自己的知识体系，这些知识内容才能应用到框架思维里面来，成为一名专家。

　　《框架思维》告诉我们，如何正确地定义问题，并设计策略，做出解决方案。这本书还有更丰富的内容待我们去阅读，比如如何“重构构架”、“学习添加新框架”、“多元框架并在”等，我们在这本书里都可以找到答案；框架思维就是我们思考的方式，是我们认识并和世界更好相处的方法论，有句话是：没有构架，再多的努力也只是低水平的重复。

　　《框架思维》读后感(九)：当你思考问题时，框架思维扮演了什么角色呢？

　　在我们在生活中，会时常提及框架，我们会从幼年时，会知道，我们看到的相框是一个框架，它是一个四四方方的小木框，可以把我们的照片放进去，我们看到窗户，会知道它的窗框可以让玻璃嵌进去阻隔风雨，让我们在屋内可以看见屋外清晰的景色，这些框，都在将一些东西固定住，稳固住，从而使它对我们生活发生作用。

　　那么在思维层面，框架思维是什么呢？又是怎样对我们的生活发生影响呢？维克托·迈尔-舍恩伯格、弗朗西斯·德维西库以及肯尼斯·库克耶所写的《框架思维》中，给我们讲解了框架思维究竟是什么，又带给我们什么影响呢？

　　当我们能够去正确的定义问题，设计策略以及直击本质，是框架思维帮助我们的吗？它究竟是怎么做到的呢？又有哪些规律和元素等着我们去了解呢？

　　当我们想要去提及框架思维时，我们明白一个框架是可以把我们限制在某个区域内，但是它的发生对我们的影响从何而来，又为什么存在呢？这不得不提及因果律，为什么呢？

　　因为我们最初脑海里是并没有这个框架的，我们空白一片，一无所知，但是，当我们在婴儿时饿了，怎么去唤醒妈妈，想去告诉她我们饿了，于是采用哭这个方式让妈妈知晓， 饿了造成哭这个行动，于是妈妈会知道因为宝宝因为饿了，所以哭了。这是一个因果原因，它构成了一个理解的行为。

　　但是有时宝宝哭了，它可能并不是饿了，它是拉粑粑了不舒服，那么又得出一个因果，拉粑粑时，宝宝也会不舒服，通过哭来唤醒妈妈来照顾宝宝。当一个个因果构成了可供反复用的思考模板，我们不必有那么多的认知负担，我们会从宝宝哭了那个大的框架里，去找，可能会有很多个可能，可能是饿了，可能是拉粑粑了，可能是其他元素了，但是都是有什么想要表达的内容。而不是无缘无故的。

　　当有了这个基础认知之后，我们的行为都是在这个框架里。一旦跳出这个框架，我们会觉得惊讶奇特，这就是我们形成在生活中常识的缘故。

　　当我们通过时间和学习的沉淀形成了我们每个人的思维框架，那么它在帮助我们节省认知时间的同时，也在框住我们每个人，这也就形成我们每个人看待事物的片面性，在这个情况下，是否有什么方式来打破这个局面，让我们能够与之相配合，让我们可以既有框架思维的获益，又能在需要打破的地方有方法来改变自己的框架并形成新的认知？

　　这就提及一个反事实思维，它是一个以目标为导向，然后做出各种预想，去提及应对可能的新情况新思想，让我们能够获得新的信息，它在我们已知的因果场景中，做出设想或猜想，它发生一些事情在另一个场景里，通过基本的因果律，去“填补”想象世界的空白。

　　很多经典的科学定律就是在这种思考中得出的，比如说牛顿的苹果，爱因斯坦的光束，薛定谔的猫，它开拓了人们的视野，帮助人们做出了改变世界看法的伟大发现。

　　在生活里，我们通过他人视角去看待自己的行为进行自省这个过程，本质上也是反事实思维的一种应用形式，它使我们能够跳出自己的视角框架，而获得一种新的理解和共鸣。

　　当我们知道框架思维能够帮助我们获得很多高效便捷的收益，但同时也会在某些方面限制我们时，我们可以通过反事实思维来对自己进行一种突破与跳出，这个过程里，我们需要注意的又是什么呢？

　　在书里提及了一个约束，它并不是说我们要把自己从一个框架限制在另一个框架，而是在跳出与突破的时候，它需要遵循一些规则和限制，这些约书条件，让我们能够有效释放创造力，能够沿着正确 的方向前行，而不是跑偏而不自知。

　　它某种意义上，就像我们对待孩子的指引，我们在引导孩子时，可以给其天性的释放和发展，但这种发展中，有着某种不能逾越的规则，比如不能允许孩子以伤害他人的方式来愉悦自己，这是一种作为的基本人性，即便你想要给与自由，也是要以不伤害他人的基础上的一种释放与创造。

　　这就构成了书中提及的约束这个概念内容，我们在生活里，在思考里，都是在自己的理解中不断的去跳出和理解自己所知所感的一种框架和认知，训练自己的思维同时，也是在更扩展自己的认知领域，不断地在新的思维领域重建，创造，再突破，再创造，它构成了我们体验多元框架的认知领域。

　　《框架思维》在对思维层面的剖析间，让我们更深入地看见自己认知思考的本质，以及如何突破的本质，它让我们去习得并获得属于自己的做事方法，形成我们每个人独特专属的方法论，让我们的生命变得更精彩，更有获得感！

　　《框架思维》读后感(十)：如何提升说话做事的能力？学会建构框架而不是盲目努力

　　本书是一本教我们如何搭建认知框架的书，书中说，高手做事，都有自己的框架，而框架可以帮助我们正确地定义问题，设计策略，从而直击事物的本质。

　　面对熟悉的场景，框架可以帮助我们迅速做出反应，而不必惊慌失措。面对不熟悉的新情况，框架能够从旧有的知识中整合出新方法，以更高明的方式解决问题。

　　而建构和应用框架，是独属于我们的特殊能力，是我们应对不断变化的复杂世界的强大工具。

　　01、什么是框架思维

　　什么是框架？框架其实就是我们的认知体系，一个人的认知高度决定着我们解决问题的能力。而认知是由我们的心智模式决定。

　　那什么是框架思维？框架思维就是协助我们做出选择、做出判断的底层架子，我们也可称为认知框架。

　　这就是我们的认知框架不完善的结果。也就是说，认知能力不够，会影响我们对一件事情的决策，如果当时这个孩子意识到下去游泳是一件危险的事情，那么结果可能就不会是这样了。

　　我们无时无刻不在做决定，不管是工作还是生活，都需要我们去思考，怎么做对我们来说才是最好的选择呢？

　　作者说，我们的框架都是在潜意识下运作，如果你没有刻意思考，我们往往不会知道自己在某个场景下用的是什么框架，为什么用这个框架。

　　所以，我们需要优化我们的认知框架。作者在书中提到了3个框架的底层要素，我们可以通过这3个要素来构建我们的框架，并且这3个要素相辅相成，缺一不可。

　　1、因果律

　　什么是因果律？简而言之，就是从原因推论出结果。我们能够在行动之前，预测出每个决定可能带来的后果，从而不断修正优化自己的行动方案。

　　因果关系存在于一切生物之中，并且人类在一生下来就懂得某些对世界因果关系的认知，比如婴儿知道掉落的物体会垂直落下。而其他动物不会进行这种抽象的框架建构，一只狗伸出爪子就会得到奖励，但是它并不知道是因为它表现出了友好。

　　作者说，人类具有抽象能力，能够把因果推论转化为框架，这些心智模型就成为可供我们反复利用的模版，可以不断的应用到新环境中，她未必完美，但是灵活，可以相互替代，可以减轻我们认知负担，节约决策时间。

　　那么我应该如何更好地运用因果模版进行思考呢？首先，要有因果模板意识。其次，在思考问题时要懂得如何去利用它。你可以问问自己：“发生这件事的原因是什么？我们心里对此所做的假设或解释是什么，是否正确呢？”

　　2、反事实思维

　　我们的大脑经常会脑补很多画面，设想无数的可能性，设想世界的另一番样子，设想别样的人生是怎样的。反事实思维就是以目标为导向，透过现状作出各种预想，提前应对可能出现的新情况、新问题。

　　若无法想象“本来可以是什么”“已经发生过什么”，”未来可能会是什么“，我们就永远被困在“现在是什么”的此时此地之中。

　　当然，反事实思维取决于对因果关系的理解，让我们设想未来或假设过去，把一个场景纳入到另一个场景中。使我们能够“填补”想象世界的“空白”，也就是利用已掌握的信息来想象自己缺失的信息。如果没有因果关系，我们将被淹没在无意义的事件中无法自拔，如果缺少了反事实思维，我们将被现实所困，毫无选择的余地。

　　像我们知道的牛顿的苹果、爱因斯坦的光束、薛定谔的猫等等，都是通过反事实思维来帮助他们开拓了视野，最终帮助他们做出了足以改变人们对世界看法的伟大发明。反事实思维有什么优势呢？

　　第一，反事实思维可当作是对“因果决定论”的一种制衡。因果决定论认为道路只有一条，但是当你想象另一种可能性时，也会想到不同的原因；

　　第二，能让我们成为更好的因果思考者，当你看见更多可能性时，视野也会被拓宽，而不会被困于泥沼；

　　第三，可以变得为我所用，想象某些不存在的东西，比用纯粹的概念术语思考更容易；

　　第四，激活我们的隐性知识，发现更多创造性解决方案；

　　第五，给人一种使命感，使我们从理解转向行动，从领悟转向决策。

　　那么我们应该如何锻炼反事实思维呢？首先，使用“假扮游戏”锻炼我们想象虚拟现实的能力，就是通过想象来探索世界。

　　心理学家戈普尼克提出过一个理论，叫做“理论中的理论”。该理论认为，婴幼儿使用因果思考和反事实推理与科学家做实验时使用的并没有不同，而且他们也有自己的心智模型。她解释说，当科学家以这种方式进行推理时，人们将此定义为“研究”；而对于学步儿童，称之为“对什么都好奇”。

　　这个实验我们可以看出，儿童会通过玩耍，来探索世界，试图搞清楚周围的一切。他们被激发了想象力，利用想象力实现与他人的互动并更好地认识世界。

　　因此，戈普尼克说：“善于假扮的孩子能够更好地进行反事实推理”。他们会在玩耍中模仿成年人所展开的活动、技能，然后把游戏拓展延伸到广阔的想象世界中。

　　其次，应用心理预演，也就是讲故事的能力。故事就好比一个平台，使人们得以思考替代现实的场景以及在此场景中该做什么行动。有助于我们评估选择，做出决策。

　　3、约束

　　什么是约束？就是以特定的方式塑造我们反事实思维的规则和限制。作者说，只有加上规则和限制等约束条件，才能有效释放创造力，沿着正确的方向前进。因为我们人类的想象力是无穷无尽的，我们可以想象出无数与因果心智模型无关的现实，但是并不一定对我们会有价值。

　　某种意义上来说，约束释放了我们的自由，而非捆绑了手脚。比如，你是一名设计师，业主想让你帮他设计一下住宅，你问他有什么需求，业主的回答是：你看着来就行。听到这样的回答，你什么感受？我们会觉得毫无头绪，什么叫做看着来，这就是一个毫无约束的例子。

　　当没有约束条件的时候，往往更让我们头疼，我们不知道该如何下手。如果设计师设计出来的图业主总是不满意，那么设计师就会浪费大量的时间在这里，无法做更有价值的事情。所以，在很多时候约束会让我们更有效率。

　　作者说，应对约束，要收放自如，过多或过少，都不行。过多可能会错多要事，而过少会使我们无法聚焦。那么我们应该怎么做呢？

　　第一，我们需要认识到，任何框架都有软约束和硬约束，软约束具有弹性或可改变，只需付出相当的努力即可进行调整。而硬约束是固定的、不可渗透和不可侵犯的。硬性约束是心智模型的核心，忽略它就意味着放弃框架本身。

　　所以，我们首先需要确保那些硬性约束，而在选择软性约束时，可以进行灵活调整。作者给出三条建议：

　　1.可变性：选择可以改变的约束；

　　2.最小变化：对约束仅做微调，而非彻底改变；

　　3.一致性：某个约束的改变不能与另一个约束产生矛盾和冲突。

　　所以，我们可以看出框架赋予我们认识能力和行动能力，它也确保我们的认识和行动的意义。但是，假如我们现有的框架无法满足需要时，我们就需要重建建构框架。

　　02、如何重新建构框架

　　作者说，有时候我们需要转换框架或建构新的框架，从而带来新的思路和一系列新的选项。人人都可以构建框架，我们只要掌握了方法，然后通过训练和不断的积累经验就可以建立新的框架，同时我们还需要对新事物持开放态度。也就是说，我们需要以积极的心态去接受新的事物。

　　在构建框架时，我们还需要避免框架的僵化，增强思维敏捷性，也就是保持框架的灵活性。比如，普通人会对自己的框架进行不断调整，修正，而恐怖分子把这种认知的灵活性视为堕落，而把自己构建框架中的僵化看作是纯粹和秩序的象征，因而作出很多非理性行为。

　　那么具体应该如何构建框架呢？作者给出了3个方法来帮助我们重构框架。

　　1、框架目录

　　框架目录就是在头脑的思维框架中能快速搜索，看是否有可行的替代框架。

　　当使用我们的框架目录时，了解自己拥有的每种框架的优劣对于确定最佳框架至关重要。当然，我们需要确保有足够多的框架可供我们选择。

　　2、重新调整

　　就是对某个借鉴来的框架在原有的基础上重新调整。这种情况通常发生在需要重新建构框架却没有现成的替代框架可供选择时。

　　宜家最初成功的关键在于，它对家具的定义和用途采用了另一种思维框架，即家具是有使用年限的，而非恒久可用。其实这一框架一直都存在，只是没有人发现而已。

　　3、全新框架

　　那如果我们不能借助既有的框架目录或利用其他框架重新进行调整呢？我们就需要创建一个全新的框架，即重新构建框架。

　　该理论一经推出，物理学家们便发现它更好地解释了世界。所以，创新首先是一种看不见摸不着的思维过程，然后才被实例化为方程式、法律或软件等。人的整个心智模式必须改变。

　　作者还提醒我们说，不要执着迷信于自己的框架，而是需要接受不同的观点，听取不同的意见和建议。只有这样我们才能构建出好的认知框架。

　　当然，新框架并不是简简单单就可以成功的，重新创建框架会遇到四大障碍：

　　首先，我们要有架构新框架的认知力，也就是从心态上接受重新创建框架这一事实，毕竟对于跨过已知的领域往往是不容易接受的；

　　其次，要远离熟悉的事物，这是为了新的认知框架腾出空间；

　　接着，要确定合宜的框架，根据特定的情况实现自己的目标；

　　最后，要把握住最佳的重构时机。

　　作者说，没有框架，再多的努力也只是低水平的重复。构建框架是我们对一件事情的认知能力，当我们的认知能力达到一定的境界之后，我们的心智模式也就成熟了，可以帮助我们更好的进行选择和决策，从而正确地定义问题，设计策略。
